{"storys":[{"story":"I was born in San Dimas, CA on November 17, 1998\n","date":"November 17, 1998\n","headline":"Born","location":"San Dimas, CA\n","image":"baby","latitude":"34.1028","longitude":""},{"story":"As a child I was introduced to computer at a young age both at home and at school. I started out at home on a very old Windows 95 (Sorry) as well as a eMac and at School the eMac. I was hooked to the start. Immediatly after starting out on computer I came to love the Macintosh more and more and begged my parents at a young age to buy a eMac.","date":"","headline":"Computer Nerd","location":"San Dimas, CA\n","image":"computer"},{"story":"Back in 2011 as I was looking to advance in my computer skills, I had the opportunity in the church to participate in being the new Media guy who would be in charge of all media communications. As a student at the age 12 I competed against mulitple adults to earn the new position. After 2 months of trial every week at church I was selected overall as the new media technician. I continue to hold that position still today at church.","date":"January 2011","headline":"Media Technician","location":"San Dimas, CA\n","image":"media"},{"story":"In 2012 I was hired as a technician for the Passion Conference where I worked with another developer of mine, Nico Plyley to help out in media, sound, lighting, and recording of the event. However, that very night, as Nico and I were continuing to work on the event I accidently stood up from where we were sitting, which was called the soundbooth that is located up the stairs about 25ft. from the floor. As I stood up I accidently hit the camera, that Nico owned, and it fell 25ft to the ground, smashing into the hard gym floor. The camera was fine and Nico was very upset me. But it was all good.\n","date":"February 2012","headline":"Behind the Scenes","location":"Glendora, CA","image":"passion"},{"story":"In 2012, I attended ID Tech Camps at the University of California, Irvine, where I was instructed on the basics of Computer Science and C++ '11. This launched me into me actually getting start with C where I would expand my knowledge onto Cocoa Applications and build for iPhone and iPad.","date":"July 2012","headline":"C++ '11","location":"Irvine, CA","image":"idtech1"},{"story":"In 2013, I registered as a iOS Application Developer and successfully developed and published my own Application called I'm Lost which was a success and had many downloads and today still continues to be a success on the market.","date":"January 2013","headline":"iOS Application Developer","location":"San Dimas, CA","image":"ios"},{"story":"Back in January of 2013, I developed and released my first iOS Application for free to the public, called I'm Lost. I'm Lost typically doesn't recieve many updates, but when it does there are a ton of new features. I'm lost has become this basic app to tell you where you were and give you the option to dial 911 to now being able to send a text message to 911 describing your situation with the tap of a button and now being able to recongize gesture recongnition to detect how hard a phone might hit the ground to aslk the user if they are okay and if they would like to contact 911, these features are planned tor release here very soon ","date":"January 2013","headline":"I'm Lost","location":"San Dimas, CA","image":"imlost","appStore":"https://itunes.apple.com/us/app/im-lost-fastest-way-to-communicate/id593310620?mt=8#"},{"story":"In May of 2013, I competed in the ACSI Technology Fair where I developed a simple app that was built iOS 6. The Americas gave children an introduction to the many countires located in both North and South America. ","date":"May 2013","headline":"The Americas","location":"Tustin, CA","image":"techfair","appStore":"https://itunes.apple.com/us/app/the-americas/id650159848?ls=1&mt=8#"},{"story":"In 2013 when it became time to graduate middle school. I was honored with a award the administration had came up with for one this one occassion and that was the Student IT award. I earned the award for helping and teaching the teachers how to use and operate there Macintosh computers and install and update them on a regular basis when the IT professional was not present ","date":"June 2013","headline":"IT Award","location":"Glendora, CA","image":"award"},{"story":"At the end of 2013 I had finally had a business in the State of Calfornia which I still own and continue to work today. The business is name Roeboat, LLC., huh I wonder how I came up with that name?","date":"October 2013","headline":"Roeboat, LLC.","location":"San Dimas, CA","image":"roeboat"},{"story":"In April of 2014 I completed a Science Fair project where we looked to see the realism behind physics in video game by programming a small app for the iPad. With the data we collected physics are very similar however are not the same. This earned us 2nd place in High School Engineering","date":"April 2014","headline":"High School Engineering","location":"La Mirada, CA","image":"scienceexpo1"},{"story":"In 2014 I began a App called MyCoffee, which is about to hit beta testers in Mid-May. It's a social networking app surounded by Coffee for Coffee Lovers. This app was suggested to me by a bunch of people in my P.E. class last year. After starting it and looking back at it now I'm very proud of what I have learned and accomplished in MyCoffee ","date":"May 2014","headline":"MyCoffee","location":"Upland, CA","image":"mycoffee"},{"story":"In June of 2014, after saving up 2-3 years, I had the opportunity to go to WWDC '14 as a paid attendee. It was a life changing experience that has helped me develope more efficiently and discover new tools and gadgets throguhout my developing. With WWDC I became more of a professional code rather than a do it for fun coder. WWDC 2014 was a life changer.","date":"June 2014","headline":"WWDC '14","location":"San Fransisco, CA","image":"wwdc"},{"story":"In July of 2014, I released Draft Journal - Your Key to the Draft Process which is a app to help college students who are being scouted and drafted into the MLB. The app had hit some points where the visionary behind the project keeps delaying causing the app to have a slow production. We hope to actual publicize it by the end of 2015","date":"July 2014","headline":"Draft Journal","location":"San Dimas, CA","image":"draftjournal","appStore":"https://itunes.apple.com/us/app/draft-journal-your-key-to/id891094057?mt=8#"},{"story":"In November of 2014, I was invited back to my middle school to talk and give a demonstration into the world of iOS Applciation Development where I discussed a few of my apps and showcased some of my beta works that are not out yet. The response was very encouraging and I had many people asking me how they could get started","date":"November 2014","headline":"The Life of a Techie","location":"Glendora, CA","image":"talks"},{"story":"In April of 2015, I returned to the regional science fair where I took 1st place in engineering working with a accelerometer and developing a iPhone app using a dedicated API that calculates the G-Force a person experiences on the front and back of a roller coaster. We discovered that you experience more G-force in the back. Using the nifty tool and the help of an iPhone 6 we were able to solve this question.","date":"April 2015","headline":"High School Engineering 2.0","location":"La Mirada, CA","image":"sciexpo2"},{"story":" This year my hope is to have the opportunity to attend WWDC once again. It was such a life changing experience last time and I only imagine it will shape me for the way I develop in the future. Before signing off, I want to thank you for even bothering to take the time at my application. And thank you for given students like me the opportunity to try and earn a scholarship to attend. God Bless! I look forward (to hopefully) seeing you at WWDC'15","date":"","headline":"WWDC '15","location":"San Fransisco, CA","image":"wwdc2"}]}